In [1]:
import numpy as np

## Pandas
- it is a important module in data science libraries
- stands for pannel data 
- data structures
    -series
    -dataframes
- with is we can do the data
analysis,manuplations,cleaning
- data analysation
    - statistics of the data 
    - volume of the data 
- data manuplation
    - changing data from one form to another 
    - merging and concatenation.. etc!
- data cleaning 
    - removing unwanted data 
    - deleting null values and Nan values.. etc!

In [2]:
import pandas as pd 

pd.__version__

'1.2.4'

In [3]:
dir(pd)

['BooleanDtype',
 'Categorical',
 'CategoricalDtype',
 'CategoricalIndex',
 'DataFrame',
 'DateOffset',
 'DatetimeIndex',
 'DatetimeTZDtype',
 'ExcelFile',
 'ExcelWriter',
 'Flags',
 'Float32Dtype',
 'Float64Dtype',
 'Float64Index',
 'Grouper',
 'HDFStore',
 'Index',
 'IndexSlice',
 'Int16Dtype',
 'Int32Dtype',
 'Int64Dtype',
 'Int64Index',
 'Int8Dtype',
 'Interval',
 'IntervalDtype',
 'IntervalIndex',
 'MultiIndex',
 'NA',
 'NaT',
 'NamedAgg',
 'Period',
 'PeriodDtype',
 'PeriodIndex',
 'RangeIndex',
 'Series',
 'SparseDtype',
 'StringDtype',
 'Timedelta',
 'TimedeltaIndex',
 'Timestamp',
 'UInt16Dtype',
 'UInt32Dtype',
 'UInt64Dtype',
 'UInt64Index',
 'UInt8Dtype',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__docformat__',
 '__file__',
 '__getattr__',
 '__git_version__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_config',
 '_hashtable',
 '_is_numpy_dev',
 '_lib',
 '_libs',
 '_np_version_under1p17',
 '_np_version_under1p18',
 '_testing',
 '_tslib',
 '_typing',
 '_version',
 'api',
 'array',
 'arrays',
 'bdate_range',
 'compat',
 'concat',
 'core',
 'crosstab',
 'cut',
 'date_range',
 'describe_option',
 'errors',
 'eval',
 'factorize',
 'get_dummies',
 'get_option',
 'infer_freq',
 'interval_range',
 'io',
 'isna',
 'isnull',
 'json_normalize',
 'lreshape',
 'melt',
 'merge',
 'merge_asof',
 'merge_ordered',
 'notna',
 'notnull',
 'offsets',
 'option_context',
 'options',
 'pandas',
 'period_range',
 'pivot',
 'pivot_table',
 'plotting',
 'qcut',
 'read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_orc',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_spss',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table',
 'reset_option',
 'set_eng_float_format',
 'set_option',
 'show_versions',
 'test',
 'testing',
 'timedelta_range',
 'to_datetime',
 'to_numeric',
 'to_pickle',
 'to_timedelta',
 'tseries',
 'unique',
 'util',
 'value_counts',
 'wide_to_long']

In [5]:
a = pd.Series("i am from vrsec")
a

0    i am from vrsec
dtype: object

In [7]:
b = input()
c = pd.Series(b.split(" ")) #using split() we get the indexing for each
c

i am vrsec

0        i
1       am
2    vrsec
dtype: object

In [8]:
t = (1,2,3,4,5,6,7,8) #by using tuple data structure
t1 = pd.Series(t)
t1

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
dtype: int64

In [9]:
t = [1,2,3,4,5,6,7,8] #by using list data structure 
t1 = pd.Series(t)
t1

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
dtype: int64

In [10]:
d = pd.Series(range(20,25)) # using range in pandas 
d

0    20
1    21
2    22
3    23
4    24
dtype: int64

In [11]:
dic = {'list':[1,2,3],"tuple":(91,2,3,4),"string":"hit","int":34}## creating dictionary with all data types
dic

{'list': [1, 2, 3], 'tuple': (91, 2, 3, 4), 'string': 'hit', 'int': 34}

In [12]:
dic1 = pd.Series(dic)
dic1

list          [1, 2, 3]
tuple     (91, 2, 3, 4)
string              hit
int                  34
dtype: object

In [13]:
dic1.index

Index(['list', 'tuple', 'string', 'int'], dtype='object')

In [14]:
dic1.values

array([list([1, 2, 3]), (91, 2, 3, 4), 'hit', 34], dtype=object)

In [15]:
dic1.keys

<bound method Series.keys of list          [1, 2, 3]
tuple     (91, 2, 3, 4)
string              hit
int                  34
dtype: object>

In [17]:
import numpy as np 
arr= np.arange(10,50,5)
arr1=pd.Series(arr)
arr1

0    10
1    15
2    20
3    25
4    30
5    35
6    40
7    45
dtype: int32

In [18]:
arr1[0]

10

In [19]:
arr1[5]

35

In [20]:
len(arr1)

8

In [21]:
arr1[len(arr1)-1]

45

In [22]:
arr1[0:2]

0    10
1    15
dtype: int32

In [23]:
arr1.index

RangeIndex(start=0, stop=8, step=1)

In [24]:
arr1.index = [1,2,3,4,5,6,7,8]
arr1

1    10
2    15
3    20
4    25
5    30
6    35
7    40
8    45
dtype: int32

In [25]:
li = ["hi","hello","good","open"]
ind = [i for i in range(15,19)]
pd.Series(li,index = ind)

15       hi
16    hello
17     good
18     open
dtype: object

In [26]:
dic2 = pd.Series(dic,index=ind)
dic2

15    NaN
16    NaN
17    NaN
18    NaN
dtype: object

In [27]:
dic2.index

Int64Index([15, 16, 17, 18], dtype='int64')

## Data Frames 
- data is in 2nd format

In [29]:
import pandas as pd 
import numpy as np
pd.DataFrame(dic2)

      0
15  NaN
16  NaN
17  NaN
18  NaN

In [32]:
data = {56:"fiftysix","float":10.23,"prgm": "workshop","name":"Viswanth","roll no":"01"}
data

{56: 'fiftysix',
 'float': 10.23,
 'prgm': 'workshop',
 'name': 'Viswanth',
 'roll no': '01'}

In [33]:
pd.DataFrame(data,index="i am n vr".split(" "))

          56  float      prgm      name roll no
i   fiftysix  10.23  workshop  Viswanth      01
am  fiftysix  10.23  workshop  Viswanth      01
n   fiftysix  10.23  workshop  Viswanth      01
vr  fiftysix  10.23  workshop  Viswanth      01

In [36]:
df1 = pd.DataFrame(data,index = [1,2,3])
df1

          56  float      prgm      name roll no
1   fiftysix  10.23  workshop  Viswanth      01
2  fi98tysix  10.23  workshop  Viswanth      01
3   fiftysix  10.23  workshop  Viswanth      01

In [40]:
df2 = pd.DataFrame(data,index ="1 2 3".split())
pd.concat([dic2,df2])

      0         56  float      name      prgm roll no
15  NaN        NaN    NaN       NaN       NaN     NaN
16  NaN        NaN    NaN       NaN       NaN     NaN
17  NaN        NaN    NaN       NaN       NaN     NaN
18  NaN        NaN    NaN       NaN       NaN     NaN
1   NaN   fiftysix  10.23  Viswanth  workshop      01
2   NaN  fi98tysix  10.23  Viswanth  workshop      01
3   NaN   fiftysix  10.23  Viswanth  workshop      01

In [42]:
dic3 = {"first":[1,2,3,4],"second":[2,3,4,5],"third":[3,4,5,6]}
dic3

{'first': [1, 2, 3, 4], 'second': [2, 3, 4, 5], 'third': [3, 4, 5, 6]}

In [43]:
df3=pd.DataFrame(dic3,index=[1,2,3,4])
df3

   first  second  third
1      1       2      3
2      2       3      4
3      3       4      5
4      4       5      6

In [44]:
df4 = pd.DataFrame({'forth':[10,20,30,40],
                    'fifth':[20,30,40,50],
                    'sixth':[30,40,5,60]},
                  index =[1,2,3,4])
df4

   forth  fifth  sixth
1     10     20     30
2     20     30     40
3     30     40      5
4     40     50     60

In [45]:
df3.join(df4)

   first  second  third  forth  fifth  sixth
1      1       2      3     10     20     30
2      2       3      4     20     30     40
3      3       4      5     30     40      5
4      4       5      6     40     50     60

In [46]:
df5 =pd.DataFrame()

In [49]:
dt = pd.date_range('2022-01-01',periods=6)
pd.Series(dt)

0   2022-01-01
1   2022-01-02
2   2022-01-03
3   2022-01-04
4   2022-01-05
5   2022-01-06
dtype: datetime64[ns]

In [50]:
data = pd.read_csv("marks.csv")
data

   Roll Name  Maths  Discrete  OS    CO    DS
0    A1    X     60        70  30  70.0  90.0
1    A2    Y     90        45  67  73.0  50.0
2    A1    G     60        70  30   NaN  90.0
3    A2    H     40        60  73  50.0   NaN
4    B1    I     50        70  90  90.0   NaN
5    B2    J     63        45  67  56.0  50.0
6    C1    K     67        70  30  75.0  40.0
7    C2    L     91        45  67  72.0  50.0
8    D1    M     40        70  50   NaN  90.0
9    D2    N      5        67  65  50.0   NaN
10   E1    X     50        70  30  80.0  90.0
11   E2    Y     60        45  77  73.0  40.0

In [52]:
data.sample(2)

  Roll Name  Maths  Discrete  OS    CO    DS
5   B2    J     63        45  67  56.0  50.0
2   A1    G     60        70  30   NaN  90.0

In [53]:
data['Roll']

0     A1
1     A2
2     A1
3     A2
4     B1
5     B2
6     C1
7     C2
8     D1
9     D2
10    E1
11    E2
Name: Roll, dtype: object

In [55]:
data[["Roll","Name","Maths"]]

   Roll Name  Maths
0    A1    X     60
1    A2    Y     90
2    A1    G     60
3    A2    H     40
4    B1    I     50
5    B2    J     63
6    C1    K     67
7    C2    L     91
8    D1    M     40
9    D2    N      5
10   E1    X     50
11   E2    Y     60

In [57]:
new = pd.read_csv("marks.csv",usecols = ["Name","Maths"])
new

   Name  Maths
0     X     60
1     Y     90
2     G     60
3     H     40
4     I     50
5     J     63
6     K     67
7     L     91
8     M     40
9     N      5
10    X     50
11    Y     60

In [58]:
data.columns

Index(['Roll', 'Name', 'Maths', 'Discrete', 'OS', 'CO', 'DS'], dtype='object')

In [59]:
data.index

RangeIndex(start=0, stop=12, step=1)

In [60]:
data.dtypes

Roll         object
Name         object
Maths         int64
Discrete      int64
OS            int64
CO          float64
DS          float64
dtype: object

In [61]:
data.info

<bound method DataFrame.info of    Roll Name  Maths  Discrete  OS    CO    DS
0    A1    X     60        70  30  70.0  90.0
1    A2    Y     90        45  67  73.0  50.0
2    A1    G     60        70  30   NaN  90.0
3    A2    H     40        60  73  50.0   NaN
4    B1    I     50        70  90  90.0   NaN
5    B2    J     63        45  67  56.0  50.0
6    C1    K     67        70  30  75.0  40.0
7    C2    L     91        45  67  72.0  50.0
8    D1    M     40        70  50   NaN  90.0
9    D2    N      5        67  65  50.0   NaN
10   E1    X     50        70  30  80.0  90.0
11   E2    Y     60        45  77  73.0  40.0>

In [62]:
data = pd.read_csv("income.csv")

In [63]:
data

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [68]:
data["State"].value_counts()

Arizona       1
California    1
Alaska        1
Alabama       1
Arkansas      1
Name: State, dtype: int64

In [72]:
data.sort_values("State")

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [73]:
data = pd.read_csv("marks.csv")
data

   Roll Name  Maths  Discrete  OS    CO    DS
0    A1    X     60        70  30  70.0  90.0
1    A2    Y     90        45  67  73.0  50.0
2    A1    G     60        70  30   NaN  90.0
3    A2    H     40        60  73  50.0   NaN
4    B1    I     50        70  90  90.0   NaN
5    B2    J     63        45  67  56.0  50.0
6    C1    K     67        70  30  75.0  40.0
7    C2    L     91        45  67  72.0  50.0
8    D1    M     40        70  50   NaN  90.0
9    D2    N      5        67  65  50.0   NaN
10   E1    X     50        70  30  80.0  90.0
11   E2    Y     60        45  77  73.0  40.0

In [74]:
data.sort_values("Roll",ascending = False)

   Roll Name  Maths  Discrete  OS    CO    DS
11   E2    Y     60        45  77  73.0  40.0
10   E1    X     50        70  30  80.0  90.0
9    D2    N      5        67  65  50.0   NaN
8    D1    M     40        70  50   NaN  90.0
7    C2    L     91        45  67  72.0  50.0
6    C1    K     67        70  30  75.0  40.0
5    B2    J     63        45  67  56.0  50.0
4    B1    I     50        70  90  90.0   NaN
1    A2    Y     90        45  67  73.0  50.0
3    A2    H     40        60  73  50.0   NaN
0    A1    X     60        70  30  70.0  90.0
2    A1    G     60        70  30   NaN  90.0

In [75]:
data.CO.sum()

689.0

In [76]:
data.isnull()

     Roll   Name  Maths  Discrete     OS     CO     DS
0   False  False  False     False  False  False  False
1   False  False  False     False  False  False  False
2   False  False  False     False  False   True  False
3   False  False  False     False  False  False   True
4   False  False  False     False  False  False   True
5   False  False  False     False  False  False  False
6   False  False  False     False  False  False  False
7   False  False  False     False  False  False  False
8   False  False  False     False  False   True  False
9   False  False  False     False  False  False   True
10  False  False  False     False  False  False  False
11  False  False  False     False  False  False  False

In [79]:
data.nunique()

Roll        10
Name        10
Maths        8
Discrete     4
OS           7
CO           8
DS           3
dtype: int64

In [80]:
clean = data.dropna()
clean

   Roll Name  Maths  Discrete  OS    CO    DS
0    A1    X     60        70  30  70.0  90.0
1    A2    Y     90        45  67  73.0  50.0
5    B2    J     63        45  67  56.0  50.0
6    C1    K     67        70  30  75.0  40.0
7    C2    L     91        45  67  72.0  50.0
10   E1    X     50        70  30  80.0  90.0
11   E2    Y     60        45  77  73.0  40.0